app/controllers/contracts_controller.rb

SELECT "contracts".* FROM "contracts"
---
    scope = Contract.all

SELECT COUNT(*) FROM "contracts" WHERE ((LOWER(contract_number) ILIKE '%expired%') OR (LOWER(status) ILIKE '%expired%') OR (LOWER(title) ILIKE '%expired%'))
---
    scope = Contract.all_with_filter(@options, scope)

    if params[:contracts_smart_listing] && params[:contracts_smart_listing][:page].blank?
      params[:contracts_smart_listing][:page] = 1
    end

    @contracts = smart_listing_create :contracts, scope, partial: "contracts/list", page_sizes: [10, 25, 50, 100, 250, 500]

    @csr_contracts = CsrContract.all

    now = Date.today
    month_ago = now - 30
    year_ago = now - 365
    @contracts_in_30 = Contract.where("vt_start_date >= :start_date AND vt_start_date <= :end_date", {start_date: month_ago, end_date: now}).count

INSERT INTO "contracts" ("contract_number", "status", "title", "start_date", "end_date", "total_value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @contract = Contract.create(contract_params)

UPDATE "contracts" SET "status" = $1, "updated_at" = $2 WHERE "contracts"."id" = $3  [["status", "Expire"], ["updated_at", 2016-10-11 05:09:06 UTC], ["id", 3]]
---
  def update
    @contract.update_attributes(contract_params)

DELETE FROM "contracts" WHERE "contracts"."id" = $1  [["id", 5]]
---
  def destroy
    @contract.destroy

SELECT  "contracts".* FROM "contracts" WHERE "contracts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_contract
      @contract = Contract.find(params[:id])